Revit 2027 API
IFCExtrusionCreationData.ClearOpenings Method
 Removes all cached openings from the data.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ClearOpenings()
Public Sub ClearOpenings
public:
void ClearOpenings()
member ClearOpenings : unit -> unit
See Also
Reference
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace